# Add necessary data sources
tap "caskroom/cask"
tap "AdoptOpenJDK/openjdk"

# Media
cask "spotify"
cask "vlc"

# Communication
cask "slack"

# Productivity
cask "notion"
cask "skitch"

# Dev Workspaces
cask "sublime-text"

# Dev Utilities
brew "gist"
brew "tree"
brew "wget"
brew "gnupg"
brew "node"
brew "watchman"
brew "yarn"
brew "pbzip2"
cask "imageoptim"
cask "ngrok"
cask "adoptopenjdk8"

# Install docker dependencies
# brew "docker"
# brew "docker-machine"
cask "virtualbox"
cask "vagrant"

# Design
cask "glueprint"
cask "sketch"
cask "figma"

# Browsing
cask "firefox"
cask "chrome"
